MikroElektronika/core_packages/RX/gcc/def/renesas/R5F572MDHDFB/mcu.h
typedef struct st_eptpc {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RESET : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long RESET : 1;
#endif
	} BIT;
	} PTRSTR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SCLKDIV : 3;
			unsigned long  : 5;
			unsigned long SCLKSEL : 3;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long SCLKSEL : 3;
			unsigned long  : 5;
			unsigned long SCLKDIV : 3;
#endif
	} BIT;
	} STCSELR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BYPASS0 : 1;
			unsigned long  : 15;
			unsigned long BYPASS1 : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long BYPASS1 : 1;
			unsigned long  : 15;
			unsigned long BYPASS0 : 1;
#endif
	} BIT;
	} SYBYPSR;
	char           wk0[15092];
	unsigned long  MIESR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ST : 1;
			unsigned long SY0 : 1;
			unsigned long SY1 : 1;
			unsigned long PR : 1;
			unsigned long  : 12;
			unsigned long CYC0 : 1;
			unsigned long CYC1 : 1;
			unsigned long CYC2 : 1;
			unsigned long CYC3 : 1;
			unsigned long CYC4 : 1;
			unsigned long CYC5 : 1;
			unsigned long  : 10;
#else
			unsigned long  : 10;
			unsigned long CYC5 : 1;
			unsigned long CYC4 : 1;
			unsigned long CYC3 : 1;
			unsigned long CYC2 : 1;
			unsigned long CYC1 : 1;
			unsigned long CYC0 : 1;
			unsigned long  : 12;
			unsigned long PR : 1;
			unsigned long SY1 : 1;
			unsigned long SY0 : 1;
			unsigned long ST : 1;
#endif
	} BIT;
	} MIEIPR;
	char           wk1[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CYCP0 : 1;
			unsigned long CYCP1 : 1;
			unsigned long CYCP2 : 1;
			unsigned long CYCP3 : 1;
			unsigned long CYCP4 : 1;
			unsigned long CYCP5 : 1;
			unsigned long  : 2;
			unsigned long CYCN0 : 1;
			unsigned long CYCN1 : 1;
			unsigned long CYCN2 : 1;
			unsigned long CYCN3 : 1;
			unsigned long CYCN4 : 1;
			unsigned long CYCN5 : 1;
			unsigned long  : 2;
			unsigned long PLSP : 1;
			unsigned long  : 7;
			unsigned long PLSN : 1;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long PLSN : 1;
			unsigned long  : 7;
			unsigned long PLSP : 1;
			unsigned long  : 2;
			unsigned long CYCN5 : 1;
			unsigned long CYCN4 : 1;
			unsigned long CYCN3 : 1;
			unsigned long CYCN2 : 1;
			unsigned long CYCN1 : 1;
			unsigned long CYCN0 : 1;
			unsigned long  : 2;
			unsigned long CYCP5 : 1;
			unsigned long CYCP4 : 1;
			unsigned long CYCP3 : 1;
			unsigned long CYCP2 : 1;
			unsigned long CYCP1 : 1;
			unsigned long CYCP0 : 1;
#endif
	} BIT;
	} ELIPPR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CYCP0 : 1;
			unsigned long CYCP1 : 1;
			unsigned long CYCP2 : 1;
			unsigned long CYCP3 : 1;
			unsigned long CYCP4 : 1;
			unsigned long CYCP5 : 1;
			unsigned long  : 2;
			unsigned long CYCN0 : 1;
			unsigned long CYCN1 : 1;
			unsigned long CYCN2 : 1;
			unsigned long CYCN3 : 1;
			unsigned long CYCN4 : 1;
			unsigned long CYCN5 : 1;
			unsigned long  : 2;
			unsigned long PLSP : 1;
			unsigned long  : 7;
			unsigned long PLSN : 1;
			unsigned long  : 7;
#else
			unsigned long  : 7;
			unsigned long PLSN : 1;
			unsigned long  : 7;
			unsigned long PLSP : 1;
			unsigned long  : 2;
			unsigned long CYCN5 : 1;
			unsigned long CYCN4 : 1;
			unsigned long CYCN3 : 1;
			unsigned long CYCN2 : 1;
			unsigned long CYCN1 : 1;
			unsigned long CYCN0 : 1;
			unsigned long  : 2;
			unsigned long CYCP5 : 1;
			unsigned long CYCP4 : 1;
			unsigned long CYCP3 : 1;
			unsigned long CYCP2 : 1;
			unsigned long CYCP1 : 1;
			unsigned long CYCP0 : 1;
#endif
	} BIT;
	} ELIPACR;
	char           wk2[40];
	unsigned long  STSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SYNC : 1;
			unsigned long SYNCOUT : 1;
			unsigned long  : 1;
			unsigned long SYNTOUT : 1;
			unsigned long W10D : 1;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long W10D : 1;
			unsigned long SYNTOUT : 1;
			unsigned long  : 1;
			unsigned long SYNCOUT : 1;
			unsigned long SYNC : 1;
#endif
	} BIT;
	} STIPR;
	char           wk3[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long STCF : 2;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long STCF : 2;
#endif
	} BIT;
	} STCFR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long WINT : 8;
			unsigned long  : 5;
			unsigned long CMOD : 1;
			unsigned long  : 1;
			unsigned long W10S : 1;
			unsigned long SYTH : 4;
			unsigned long DVTH : 4;
			unsigned long  : 4;
			unsigned long ALEN0 : 1;
			unsigned long ALEN1 : 1;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long ALEN1 : 1;
			unsigned long ALEN0 : 1;
			unsigned long  : 4;
			unsigned long DVTH : 4;
			unsigned long SYTH : 4;
			unsigned long W10S : 1;
			unsigned long  : 1;
			unsigned long CMOD : 1;
			unsigned long  : 5;
			unsigned long WINT : 8;
#endif
	} BIT;
	} STMR;
	unsigned long  SYNTOR;
	char           wk4[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long IPTSEL0 : 1;
			unsigned long IPTSEL1 : 1;
			unsigned long IPTSEL2 : 1;
			unsigned long IPTSEL3 : 1;
			unsigned long IPTSEL4 : 1;
			unsigned long IPTSEL5 : 1;
			unsigned long  : 26;
#else
			unsigned long  : 26;
			unsigned long IPTSEL5 : 1;
			unsigned long IPTSEL4 : 1;
			unsigned long IPTSEL3 : 1;
			unsigned long IPTSEL2 : 1;
			unsigned long IPTSEL1 : 1;
			unsigned long IPTSEL0 : 1;
#endif
	} BIT;
	} IPTSELR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MINTEN0 : 1;
			unsigned long MINTEN1 : 1;
			unsigned long MINTEN2 : 1;
			unsigned long MINTEN3 : 1;
			unsigned long MINTEN4 : 1;
			unsigned long MINTEN5 : 1;
			unsigned long  : 26;
#else
			unsigned long  : 26;
			unsigned long MINTEN5 : 1;
			unsigned long MINTEN4 : 1;
			unsigned long MINTEN3 : 1;
			unsigned long MINTEN2 : 1;
			unsigned long MINTEN1 : 1;
			unsigned long MINTEN0 : 1;
#endif
	} BIT;
	} MITSELR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ELTDIS0 : 1;
			unsigned long ELTDIS1 : 1;
			unsigned long ELTDIS2 : 1;
			unsigned long ELTDIS3 : 1;
			unsigned long ELTDIS4 : 1;
			unsigned long ELTDIS5 : 1;
			unsigned long  : 26;
#else
			unsigned long  : 26;
			unsigned long ELTDIS5 : 1;
			unsigned long ELTDIS4 : 1;
			unsigned long ELTDIS3 : 1;
			unsigned long ELTDIS2 : 1;
			unsigned long ELTDIS1 : 1;
			unsigned long ELTDIS0 : 1;
#endif
	} BIT;
	} ELTSELR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SYSEL : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long SYSEL : 1;
#endif
	} BIT;
	} STCHSELR;
	char           wk5[16];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long STR : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long STR : 1;
#endif
	} BIT;
	} SYNSTARTR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LOAD : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long LOAD : 1;
#endif
	} BIT;
	} LCIVLDR;
	char           wk6[8];
	unsigned long  SYNTDARU;
	unsigned long  SYNTDARL;
	unsigned long  SYNTDBRU;
	unsigned long  SYNTDBRL;
	char           wk7[16];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VALU : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long VALU : 16;
#endif
	} BIT;
	} LCIVRU;
	unsigned long  LCIVRM;
	unsigned long  LCIVRL;
	char           wk8[104];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GW10 : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long GW10 : 1;
#endif
	} BIT;
	} GETW10R;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LMTU : 31;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long LMTU : 31;
#endif
	} BIT;
	} PLIMITRU;
	unsigned long  PLIMITRM;
	unsigned long  PLIMITRL;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LMTU : 31;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long LMTU : 31;
#endif
	} BIT;
	} MLIMITRU;
	unsigned long  MLIMITRM;
	unsigned long  MLIMITRL;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long INFO : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long INFO : 1;
#endif
	} BIT;
	} GETINFOR;
	char           wk9[44];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CNTU : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long CNTU : 16;
#endif
	} BIT;
	} LCCVRU;
	unsigned long  LCCVRM;
	unsigned long  LCCVRL;
	char           wk10[148];
	unsigned long  PW10VRU;
	unsigned long  PW10VRM;
	unsigned long  PW10VRL;
	char           wk11[180];
	unsigned long  MW10RU;
	unsigned long  MW10RM;
	unsigned long  MW10RL;
	char           wk12[36];
	unsigned long  TMSTTRU0;
	unsigned long  TMSTTRL0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CYC : 30;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long CYC : 30;
#endif
	} BIT;
	} TMCYCR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long WTH : 29;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long WTH : 29;
#endif
	} BIT;
	} TMPLSR0;
	unsigned long  TMSTTRU1;
	unsigned long  TMSTTRL1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CYC : 30;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long CYC : 30;
#endif
	} BIT;
	} TMCYCR1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long WTH : 29;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long WTH : 29;
#endif
	} BIT;
	} TMPLSR1;
	unsigned long  TMSTTRU2;
	unsigned long  TMSTTRL2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CYC : 30;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long CYC : 30;
#endif
	} BIT;
	} TMCYCR2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long WTH : 29;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long WTH : 29;
#endif
	} BIT;
	} TMPLSR2;
	unsigned long  TMSTTRU3;
	unsigned long  TMSTTRL3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CYC : 30;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long CYC : 30;
#endif
	} BIT;
	} TMCYCR3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long WTH : 29;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long WTH : 29;
#endif
	} BIT;
	} TMPLSR3;
	unsigned long  TMSTTRU4;
	unsigned long  TMSTTRL4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CYC : 30;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long CYC : 30;
#endif
	} BIT;
	} TMCYCR4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long WTH : 29;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long WTH : 29;
#endif
	} BIT;
	} TMPLSR4;
	unsigned long  TMSTTRU5;
	unsigned long  TMSTTRL5;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CYC : 30;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long CYC : 30;
#endif
	} BIT;
	} TMCYCR5;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long WTH : 29;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long WTH : 29;
#endif
	} BIT;
	} TMPLSR5;
	char           wk13[28];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EN0 : 1;
			unsigned long EN1 : 1;
			unsigned long EN2 : 1;
			unsigned long EN3 : 1;
			unsigned long EN4 : 1;
			unsigned long EN5 : 1;
			unsigned long  : 26;
#else
			unsigned long  : 26;
			unsigned long EN5 : 1;
			unsigned long EN4 : 1;
			unsigned long EN3 : 1;
			unsigned long EN2 : 1;
			unsigned long EN1 : 1;
			unsigned long EN0 : 1;
#endif
	} BIT;
	} TMSTARTR;
	char           wk14[128];
	unsigned long  PRSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long OVRE0 : 1;
			unsigned long OVRE1 : 1;
			unsigned long OVRE2 : 1;
			unsigned long OVRE3 : 1;
			unsigned long  : 4;
			unsigned long MACE : 1;
			unsigned long  : 19;
			unsigned long URE0 : 1;
			unsigned long URE1 : 1;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long URE1 : 1;
			unsigned long URE0 : 1;
			unsigned long  : 19;
			unsigned long MACE : 1;
			unsigned long  : 4;
			unsigned long OVRE3 : 1;
			unsigned long OVRE2 : 1;
			unsigned long OVRE1 : 1;
			unsigned long OVRE0 : 1;
#endif
	} BIT;
	} PRIPR;
	char           wk15[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACU : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACU : 24;
#endif
	} BIT;
	} PRMACRU0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACL : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACL : 24;
#endif
	} BIT;
	} PRMACRL0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACU : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACU : 24;
#endif
	} BIT;
	} PRMACRU1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACL : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACL : 24;
#endif
	} BIT;
	} PRMACRL1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TDIS : 2;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long TDIS : 2;
#endif
	} BIT;
	} TRNDISR;
	char           wk16[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MOD : 1;
			unsigned long  : 7;
			unsigned long FWD0 : 1;
			unsigned long FWD1 : 1;
			unsigned long  : 22;
#else
			unsigned long  : 22;
			unsigned long FWD1 : 1;
			unsigned long FWD0 : 1;
			unsigned long  : 7;
			unsigned long MOD : 1;
#endif
	} BIT;
	} TRNMR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long THVAL : 11;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long THVAL : 11;
#endif
	} BIT;
	} TRNCTTDR;
} st_eptpc_t;

typedef struct st_eptpc0 {
	unsigned long  SYSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long OFMUD : 1;
			unsigned long INTCHG : 1;
			unsigned long MPDUD : 1;
			unsigned long  : 1;
			unsigned long DRPTO : 1;
			unsigned long INTDEV : 1;
			unsigned long DRQOVR : 1;
			unsigned long  : 5;
			unsigned long RECLP : 1;
			unsigned long  : 1;
			unsigned long INFABT : 1;
			unsigned long  : 1;
			unsigned long RESDN : 1;
			unsigned long GENDN : 1;
			unsigned long  : 14;
#else
			unsigned long  : 14;
			unsigned long GENDN : 1;
			unsigned long RESDN : 1;
			unsigned long  : 1;
			unsigned long INFABT : 1;
			unsigned long  : 1;
			unsigned long RECLP : 1;
			unsigned long  : 5;
			unsigned long DRQOVR : 1;
			unsigned long INTDEV : 1;
			unsigned long DRPTO : 1;
			unsigned long  : 1;
			unsigned long MPDUD : 1;
			unsigned long INTCHG : 1;
			unsigned long OFMUD : 1;
#endif
	} BIT;
	} SYIPR;
	char           wk0[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACU : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACU : 24;
#endif
	} BIT;
	} SYMACRU;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACL : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACL : 24;
#endif
	} BIT;
	} SYMACRL;
	unsigned long  SYLLCCTLR;
	unsigned long  SYIPADDRR;
	char           wk1[32];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VER : 4;
			unsigned long TRSP : 4;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long TRSP : 4;
			unsigned long VER : 4;
#endif
	} BIT;
	} SYSPVRR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DNUM : 8;
			unsigned long  : 24;
#else
			unsigned long  : 24;
			unsigned long DNUM : 8;
#endif
	} BIT;
	} SYDOMR;
	char           wk2[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FLAG0 : 1;
			unsigned long FLAG1 : 1;
			unsigned long FLAG2 : 1;
			unsigned long FLAG3 : 1;
			unsigned long FLAG4 : 1;
			unsigned long FLAG5 : 1;
			unsigned long  : 2;
			unsigned long FLAG8 : 1;
			unsigned long  : 1;
			unsigned long FLAG10 : 1;
			unsigned long  : 2;
			unsigned long FLAG13 : 1;
			unsigned long FLAG14 : 1;
			unsigned long  : 17;
#else
			unsigned long  : 17;
			unsigned long FLAG14 : 1;
			unsigned long FLAG13 : 1;
			unsigned long  : 2;
			unsigned long FLAG10 : 1;
			unsigned long  : 1;
			unsigned long FLAG8 : 1;
			unsigned long  : 2;
			unsigned long FLAG5 : 1;
			unsigned long FLAG4 : 1;
			unsigned long FLAG3 : 1;
			unsigned long FLAG2 : 1;
			unsigned long FLAG1 : 1;
			unsigned long FLAG0 : 1;
#endif
	} BIT;
	} ANFR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 8;
			unsigned long FLAG8 : 1;
			unsigned long FLAG9 : 1;
			unsigned long FLAG10 : 1;
			unsigned long  : 2;
			unsigned long FLAG13 : 1;
			unsigned long FLAG14 : 1;
			unsigned long  : 17;
#else
			unsigned long  : 17;
			unsigned long FLAG14 : 1;
			unsigned long FLAG13 : 1;
			unsigned long  : 2;
			unsigned long FLAG10 : 1;
			unsigned long FLAG9 : 1;
			unsigned long FLAG8 : 1;
			unsigned long  : 8;
#endif
	} BIT;
	} SYNFR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 10;
			unsigned long FLAG10 : 1;
			unsigned long  : 2;
			unsigned long FLAG13 : 1;
			unsigned long FLAG14 : 1;
			unsigned long  : 17;
#else
			unsigned long  : 17;
			unsigned long FLAG14 : 1;
			unsigned long FLAG13 : 1;
			unsigned long  : 2;
			unsigned long FLAG10 : 1;
			unsigned long  : 10;
#endif
	} BIT;
	} DYRQFR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 8;
			unsigned long FLAG8 : 1;
			unsigned long FLAG9 : 1;
			unsigned long FLAG10 : 1;
			unsigned long  : 2;
			unsigned long FLAG13 : 1;
			unsigned long FLAG14 : 1;
			unsigned long  : 17;
#else
			unsigned long  : 17;
			unsigned long FLAG14 : 1;
			unsigned long FLAG13 : 1;
			unsigned long  : 2;
			unsigned long FLAG10 : 1;
			unsigned long FLAG9 : 1;
			unsigned long FLAG8 : 1;
			unsigned long  : 8;
#endif
	} BIT;
	} DYRPFR;
	unsigned long  SYCIDRU;
	unsigned long  SYCIDRL;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PNUM : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long PNUM : 16;
#endif
	} BIT;
	} SYPNUMR;
	char           wk3[20];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BMUP : 1;
			unsigned long STUP : 1;
			unsigned long ANUP : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long ANUP : 1;
			unsigned long STUP : 1;
			unsigned long BMUP : 1;
#endif
	} BIT;
	} SYRVLDR;
	char           wk4[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ANCE : 2;
			unsigned long  : 2;
			unsigned long SYNC : 3;
			unsigned long  : 1;
			unsigned long FUP : 3;
			unsigned long  : 1;
			unsigned long DRQ : 3;
			unsigned long  : 1;
			unsigned long DRP : 3;
			unsigned long  : 1;
			unsigned long PDRQ : 3;
			unsigned long  : 1;
			unsigned long PDRP : 3;
			unsigned long  : 1;
			unsigned long PDFUP : 3;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long PDFUP : 3;
			unsigned long  : 1;
			unsigned long PDRP : 3;
			unsigned long  : 1;
			unsigned long PDRQ : 3;
			unsigned long  : 1;
			unsigned long DRP : 3;
			unsigned long  : 1;
			unsigned long DRQ : 3;
			unsigned long  : 1;
			unsigned long FUP : 3;
			unsigned long  : 1;
			unsigned long SYNC : 3;
			unsigned long  : 2;
			unsigned long ANCE : 2;
#endif
	} BIT;
	} SYRFL1R;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MAN : 2;
			unsigned long  : 2;
			unsigned long SIG : 2;
			unsigned long  : 22;
			unsigned long ILL : 2;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long ILL : 2;
			unsigned long  : 22;
			unsigned long SIG : 2;
			unsigned long  : 2;
			unsigned long MAN : 2;
#endif
	} BIT;
	} SYRFL2R;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ANCE : 1;
			unsigned long  : 3;
			unsigned long SYNC : 1;
			unsigned long  : 3;
			unsigned long DRQ : 1;
			unsigned long  : 3;
			unsigned long PDRQ : 1;
			unsigned long  : 19;
#else
			unsigned long  : 19;
			unsigned long PDRQ : 1;
			unsigned long  : 3;
			unsigned long DRQ : 1;
			unsigned long  : 3;
			unsigned long SYNC : 1;
			unsigned long  : 3;
			unsigned long ANCE : 1;
#endif
	} BIT;
	} SYTRENR;
	char           wk5[4];
	unsigned long  MTCIDU;
	unsigned long  MTCIDL;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PNUM : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long PNUM : 16;
#endif
	} BIT;
	} MTPID;
	char           wk6[20];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ANCE : 8;
			unsigned long SYNC : 8;
			unsigned long DREQ : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long DREQ : 8;
			unsigned long SYNC : 8;
			unsigned long ANCE : 8;
#endif
	} BIT;
	} SYTLIR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ANCE : 8;
			unsigned long SYNC : 8;
			unsigned long DRESP : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long DRESP : 8;
			unsigned long SYNC : 8;
			unsigned long ANCE : 8;
#endif
	} BIT;
	} SYRLIR;
	unsigned long  OFMRU;
	unsigned long  OFMRL;
	unsigned long  MPDRU;
	unsigned long  MPDRL;
	char           wk7[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GMPR2 : 8;
			unsigned long  : 8;
			unsigned long GMPR1 : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long GMPR1 : 8;
			unsigned long  : 8;
			unsigned long GMPR2 : 8;
#endif
	} BIT;
	} GMPR;
	unsigned long  GMCQR;
	unsigned long  GMIDRU;
	unsigned long  GMIDRL;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TSRC : 8;
			unsigned long  : 8;
			unsigned long CUTO : 16;
#else
			unsigned long CUTO : 16;
			unsigned long  : 8;
			unsigned long TSRC : 8;
#endif
	} BIT;
	} CUOTSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SRMV : 16;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long SRMV : 16;
#endif
	} BIT;
	} SRR;
	char           wk8[8];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MACU : 24;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long MACU : 24;
#endif
	} BIT;
	} PPMACRU;
	union {
		unsigned long LONG;
		struct {
			
